// Get total count
SecurityIncident
| where TimeGenerated > ago(30d)
| distinct IncidentNumber
| count
| extend Category = "Total Incidents"
| union (
    // Get IoT incident count
    SecurityIncident
    | where TimeGenerated > ago(30d)
    | summarize arg_max(TimeGenerated,*) by IncidentNumber  
    | mv-expand AlertIds to typeof(string)  
    | join kind=inner (
        SecurityAlert 
        | where TimeGenerated > ago(30d)
        | where ProductName == @"Azure Security Center for IoT"
        | distinct SystemAlertId
    ) on $left.AlertIds == $right.SystemAlertId
    | distinct IncidentNumber
    | count
    | extend Category = "IoT Incidents (Excluded)"
)
| union (
    // Get non-IoT incident count
    SecurityIncident
    | where TimeGenerated > ago(30d)
    | summarize arg_max(TimeGenerated,*) by IncidentNumber  
    | mv-expand AlertIds to typeof(string)  
    | join kind=leftanti (
        SecurityAlert 
        | where TimeGenerated > ago(30d)
        | where ProductName == @"Azure Security Center for IoT"
        | distinct SystemAlertId
    ) on $left.AlertIds == $right.SystemAlertId
    | distinct IncidentNumber
    | count
    | extend Category = "Non-IoT Incidents (Kept)"
)
