DeviceNetworkEvents
| where ActionType == "InboundConnectionAttempt"
| extend LocalIPAddress = IPAddress 
| join kind=leftanti (
    DeviceNetworkInfo
    | where NetworkAdapterType == "Wwanpp"
    | extend ParsedIPs = parse_json(IPAddresses)
    | mv-expand ParsedIP = ParsedIPs
    | project DeviceName, IPAddress = tostring(ParsedIP.IPAddress)
) on DeviceName, $left.LocalIPAddress == $right.IPAddress

DeviceNetworkEvents
| where ActionType == "InboundConnectionAttempt"
| extend LocalIPAddress = IPAddress 
| join kind=leftanti (
    DeviceNetworkInfo
    | where NetworkAdapterType == "Wwanpp"
    | extend ParsedIPs = parse_json(IPAddresses)
    | mv-expand ParsedIP = ParsedIPs
    | extend IPAddress = tostring(ParsedIP.IPAddress)
    | project DeviceName, IPAddress
) on DeviceName and $left.LocalIPAddress == $right.IPAddress
